Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/pio.h
#define PIO_P_IOSSR_P19_PRIVILEGED_ACCESS     (PIO_P_IOSSR_P19_PRIVILEGED_ACCESS_Val << PIO_P_IOSSR_P19_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. Position  */
#define PIO_P_IOSSR_P19_USER_ACCESS           (PIO_P_IOSSR_P19_USER_ACCESS_Val << PIO_P_IOSSR_P19_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. Position  */
#define PIO_P_IOSSR_P20_Pos                   _UINT32_(20)                                         /* (PIO_P_IOSSR) I/O Security Status Position */
#define PIO_P_IOSSR_P20_Msk                   (_UINT32_(0x1) << PIO_P_IOSSR_P20_Pos)               /* (PIO_P_IOSSR) I/O Security Status Mask */
#define PIO_P_IOSSR_P20(value)                (PIO_P_IOSSR_P20_Msk & (_UINT32_(value) << PIO_P_IOSSR_P20_Pos)) /* Assigment of value for P20 in the PIO_P_IOSSR register */
#define   PIO_P_IOSSR_P20_PRIVILEGED_ACCESS_Val _UINT32_(0x0)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode.  */
#define   PIO_P_IOSSR_P20_USER_ACCESS_Val     _UINT32_(0x1)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode.  */
#define PIO_P_IOSSR_P20_PRIVILEGED_ACCESS     (PIO_P_IOSSR_P20_PRIVILEGED_ACCESS_Val << PIO_P_IOSSR_P20_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. Position  */
#define PIO_P_IOSSR_P20_USER_ACCESS           (PIO_P_IOSSR_P20_USER_ACCESS_Val << PIO_P_IOSSR_P20_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. Position  */
#define PIO_P_IOSSR_P21_Pos                   _UINT32_(21)                                         /* (PIO_P_IOSSR) I/O Security Status Position */
#define PIO_P_IOSSR_P21_Msk                   (_UINT32_(0x1) << PIO_P_IOSSR_P21_Pos)               /* (PIO_P_IOSSR) I/O Security Status Mask */
#define PIO_P_IOSSR_P21(value)                (PIO_P_IOSSR_P21_Msk & (_UINT32_(value) << PIO_P_IOSSR_P21_Pos)) /* Assigment of value for P21 in the PIO_P_IOSSR register */
#define   PIO_P_IOSSR_P21_PRIVILEGED_ACCESS_Val _UINT32_(0x0)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode.  */
#define   PIO_P_IOSSR_P21_USER_ACCESS_Val     _UINT32_(0x1)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode.  */
#define PIO_P_IOSSR_P21_PRIVILEGED_ACCESS     (PIO_P_IOSSR_P21_PRIVILEGED_ACCESS_Val << PIO_P_IOSSR_P21_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. Position  */
#define PIO_P_IOSSR_P21_USER_ACCESS           (PIO_P_IOSSR_P21_USER_ACCESS_Val << PIO_P_IOSSR_P21_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. Position  */
#define PIO_P_IOSSR_P22_Pos                   _UINT32_(22)                                         /* (PIO_P_IOSSR) I/O Security Status Position */
#define PIO_P_IOSSR_P22_Msk                   (_UINT32_(0x1) << PIO_P_IOSSR_P22_Pos)               /* (PIO_P_IOSSR) I/O Security Status Mask */
#define PIO_P_IOSSR_P22(value)                (PIO_P_IOSSR_P22_Msk & (_UINT32_(value) << PIO_P_IOSSR_P22_Pos)) /* Assigment of value for P22 in the PIO_P_IOSSR register */
#define   PIO_P_IOSSR_P22_PRIVILEGED_ACCESS_Val _UINT32_(0x0)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode.  */
#define   PIO_P_IOSSR_P22_USER_ACCESS_Val     _UINT32_(0x1)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode.  */
#define PIO_P_IOSSR_P22_PRIVILEGED_ACCESS     (PIO_P_IOSSR_P22_PRIVILEGED_ACCESS_Val << PIO_P_IOSSR_P22_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. Position  */
#define PIO_P_IOSSR_P22_USER_ACCESS           (PIO_P_IOSSR_P22_USER_ACCESS_Val << PIO_P_IOSSR_P22_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. Position  */
#define PIO_P_IOSSR_P23_Pos                   _UINT32_(23)                                         /* (PIO_P_IOSSR) I/O Security Status Position */
#define PIO_P_IOSSR_P23_Msk                   (_UINT32_(0x1) << PIO_P_IOSSR_P23_Pos)               /* (PIO_P_IOSSR) I/O Security Status Mask */
#define PIO_P_IOSSR_P23(value)                (PIO_P_IOSSR_P23_Msk & (_UINT32_(value) << PIO_P_IOSSR_P23_Pos)) /* Assigment of value for P23 in the PIO_P_IOSSR register */
#define   PIO_P_IOSSR_P23_PRIVILEGED_ACCESS_Val _UINT32_(0x0)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode.  */
#define   PIO_P_IOSSR_P23_USER_ACCESS_Val     _UINT32_(0x1)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode.  */
#define PIO_P_IOSSR_P23_PRIVILEGED_ACCESS     (PIO_P_IOSSR_P23_PRIVILEGED_ACCESS_Val << PIO_P_IOSSR_P23_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. Position  */
#define PIO_P_IOSSR_P23_USER_ACCESS           (PIO_P_IOSSR_P23_USER_ACCESS_Val << PIO_P_IOSSR_P23_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. Position  */
#define PIO_P_IOSSR_P24_Pos                   _UINT32_(24)                                         /* (PIO_P_IOSSR) I/O Security Status Position */
#define PIO_P_IOSSR_P24_Msk                   (_UINT32_(0x1) << PIO_P_IOSSR_P24_Pos)               /* (PIO_P_IOSSR) I/O Security Status Mask */
#define PIO_P_IOSSR_P24(value)                (PIO_P_IOSSR_P24_Msk & (_UINT32_(value) << PIO_P_IOSSR_P24_Pos)) /* Assigment of value for P24 in the PIO_P_IOSSR register */
#define   PIO_P_IOSSR_P24_PRIVILEGED_ACCESS_Val _UINT32_(0x0)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode.  */
#define   PIO_P_IOSSR_P24_USER_ACCESS_Val     _UINT32_(0x1)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode.  */
#define PIO_P_IOSSR_P24_PRIVILEGED_ACCESS     (PIO_P_IOSSR_P24_PRIVILEGED_ACCESS_Val << PIO_P_IOSSR_P24_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. Position  */
#define PIO_P_IOSSR_P24_USER_ACCESS           (PIO_P_IOSSR_P24_USER_ACCESS_Val << PIO_P_IOSSR_P24_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. Position  */
#define PIO_P_IOSSR_P25_Pos                   _UINT32_(25)                                         /* (PIO_P_IOSSR) I/O Security Status Position */
#define PIO_P_IOSSR_P25_Msk                   (_UINT32_(0x1) << PIO_P_IOSSR_P25_Pos)               /* (PIO_P_IOSSR) I/O Security Status Mask */
#define PIO_P_IOSSR_P25(value)                (PIO_P_IOSSR_P25_Msk & (_UINT32_(value) << PIO_P_IOSSR_P25_Pos)) /* Assigment of value for P25 in the PIO_P_IOSSR register */
#define   PIO_P_IOSSR_P25_PRIVILEGED_ACCESS_Val _UINT32_(0x0)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode.  */
#define   PIO_P_IOSSR_P25_USER_ACCESS_Val     _UINT32_(0x1)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode.  */
#define PIO_P_IOSSR_P25_PRIVILEGED_ACCESS     (PIO_P_IOSSR_P25_PRIVILEGED_ACCESS_Val << PIO_P_IOSSR_P25_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. Position  */
#define PIO_P_IOSSR_P25_USER_ACCESS           (PIO_P_IOSSR_P25_USER_ACCESS_Val << PIO_P_IOSSR_P25_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. Position  */
#define PIO_P_IOSSR_P26_Pos                   _UINT32_(26)                                         /* (PIO_P_IOSSR) I/O Security Status Position */
#define PIO_P_IOSSR_P26_Msk                   (_UINT32_(0x1) << PIO_P_IOSSR_P26_Pos)               /* (PIO_P_IOSSR) I/O Security Status Mask */
#define PIO_P_IOSSR_P26(value)                (PIO_P_IOSSR_P26_Msk & (_UINT32_(value) << PIO_P_IOSSR_P26_Pos)) /* Assigment of value for P26 in the PIO_P_IOSSR register */
#define   PIO_P_IOSSR_P26_PRIVILEGED_ACCESS_Val _UINT32_(0x0)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode.  */
#define   PIO_P_IOSSR_P26_USER_ACCESS_Val     _UINT32_(0x1)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode.  */
#define PIO_P_IOSSR_P26_PRIVILEGED_ACCESS     (PIO_P_IOSSR_P26_PRIVILEGED_ACCESS_Val << PIO_P_IOSSR_P26_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. Position  */
#define PIO_P_IOSSR_P26_USER_ACCESS           (PIO_P_IOSSR_P26_USER_ACCESS_Val << PIO_P_IOSSR_P26_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. Position  */
#define PIO_P_IOSSR_P27_Pos                   _UINT32_(27)                                         /* (PIO_P_IOSSR) I/O Security Status Position */
#define PIO_P_IOSSR_P27_Msk                   (_UINT32_(0x1) << PIO_P_IOSSR_P27_Pos)               /* (PIO_P_IOSSR) I/O Security Status Mask */
#define PIO_P_IOSSR_P27(value)                (PIO_P_IOSSR_P27_Msk & (_UINT32_(value) << PIO_P_IOSSR_P27_Pos)) /* Assigment of value for P27 in the PIO_P_IOSSR register */
#define   PIO_P_IOSSR_P27_PRIVILEGED_ACCESS_Val _UINT32_(0x0)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode.  */
#define   PIO_P_IOSSR_P27_USER_ACCESS_Val     _UINT32_(0x1)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode.  */
#define PIO_P_IOSSR_P27_PRIVILEGED_ACCESS     (PIO_P_IOSSR_P27_PRIVILEGED_ACCESS_Val << PIO_P_IOSSR_P27_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. Position  */
#define PIO_P_IOSSR_P27_USER_ACCESS           (PIO_P_IOSSR_P27_USER_ACCESS_Val << PIO_P_IOSSR_P27_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. Position  */
#define PIO_P_IOSSR_P28_Pos                   _UINT32_(28)                                         /* (PIO_P_IOSSR) I/O Security Status Position */
#define PIO_P_IOSSR_P28_Msk                   (_UINT32_(0x1) << PIO_P_IOSSR_P28_Pos)               /* (PIO_P_IOSSR) I/O Security Status Mask */
#define PIO_P_IOSSR_P28(value)                (PIO_P_IOSSR_P28_Msk & (_UINT32_(value) << PIO_P_IOSSR_P28_Pos)) /* Assigment of value for P28 in the PIO_P_IOSSR register */
#define   PIO_P_IOSSR_P28_PRIVILEGED_ACCESS_Val _UINT32_(0x0)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode.  */
#define   PIO_P_IOSSR_P28_USER_ACCESS_Val     _UINT32_(0x1)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode.  */
#define PIO_P_IOSSR_P28_PRIVILEGED_ACCESS     (PIO_P_IOSSR_P28_PRIVILEGED_ACCESS_Val << PIO_P_IOSSR_P28_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. Position  */
#define PIO_P_IOSSR_P28_USER_ACCESS           (PIO_P_IOSSR_P28_USER_ACCESS_Val << PIO_P_IOSSR_P28_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. Position  */
#define PIO_P_IOSSR_P29_Pos                   _UINT32_(29)                                         /* (PIO_P_IOSSR) I/O Security Status Position */
#define PIO_P_IOSSR_P29_Msk                   (_UINT32_(0x1) << PIO_P_IOSSR_P29_Pos)               /* (PIO_P_IOSSR) I/O Security Status Mask */
#define PIO_P_IOSSR_P29(value)                (PIO_P_IOSSR_P29_Msk & (_UINT32_(value) << PIO_P_IOSSR_P29_Pos)) /* Assigment of value for P29 in the PIO_P_IOSSR register */
#define   PIO_P_IOSSR_P29_PRIVILEGED_ACCESS_Val _UINT32_(0x0)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode.  */
#define   PIO_P_IOSSR_P29_USER_ACCESS_Val     _UINT32_(0x1)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode.  */
#define PIO_P_IOSSR_P29_PRIVILEGED_ACCESS     (PIO_P_IOSSR_P29_PRIVILEGED_ACCESS_Val << PIO_P_IOSSR_P29_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. Position  */
#define PIO_P_IOSSR_P29_USER_ACCESS           (PIO_P_IOSSR_P29_USER_ACCESS_Val << PIO_P_IOSSR_P29_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. Position  */
#define PIO_P_IOSSR_P30_Pos                   _UINT32_(30)                                         /* (PIO_P_IOSSR) I/O Security Status Position */
#define PIO_P_IOSSR_P30_Msk                   (_UINT32_(0x1) << PIO_P_IOSSR_P30_Pos)               /* (PIO_P_IOSSR) I/O Security Status Mask */
#define PIO_P_IOSSR_P30(value)                (PIO_P_IOSSR_P30_Msk & (_UINT32_(value) << PIO_P_IOSSR_P30_Pos)) /* Assigment of value for P30 in the PIO_P_IOSSR register */
#define   PIO_P_IOSSR_P30_PRIVILEGED_ACCESS_Val _UINT32_(0x0)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode.  */
#define   PIO_P_IOSSR_P30_USER_ACCESS_Val     _UINT32_(0x1)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode.  */
#define PIO_P_IOSSR_P30_PRIVILEGED_ACCESS     (PIO_P_IOSSR_P30_PRIVILEGED_ACCESS_Val << PIO_P_IOSSR_P30_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. Position  */
#define PIO_P_IOSSR_P30_USER_ACCESS           (PIO_P_IOSSR_P30_USER_ACCESS_Val << PIO_P_IOSSR_P30_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. Position  */
#define PIO_P_IOSSR_P31_Pos                   _UINT32_(31)                                         /* (PIO_P_IOSSR) I/O Security Status Position */
#define PIO_P_IOSSR_P31_Msk                   (_UINT32_(0x1) << PIO_P_IOSSR_P31_Pos)               /* (PIO_P_IOSSR) I/O Security Status Mask */
#define PIO_P_IOSSR_P31(value)                (PIO_P_IOSSR_P31_Msk & (_UINT32_(value) << PIO_P_IOSSR_P31_Pos)) /* Assigment of value for P31 in the PIO_P_IOSSR register */
#define   PIO_P_IOSSR_P31_PRIVILEGED_ACCESS_Val _UINT32_(0x0)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode.  */
#define   PIO_P_IOSSR_P31_USER_ACCESS_Val     _UINT32_(0x1)                                        /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode.  */
#define PIO_P_IOSSR_P31_PRIVILEGED_ACCESS     (PIO_P_IOSSR_P31_PRIVILEGED_ACCESS_Val << PIO_P_IOSSR_P31_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in Privileged-Access mode. Position  */
#define PIO_P_IOSSR_P31_USER_ACCESS           (PIO_P_IOSSR_P31_USER_ACCESS_Val << PIO_P_IOSSR_P31_Pos) /* (PIO_P_IOSSR) The I/O line of the I/O group 0 is in User-Access mode. Position  */
#define PIO_P_IOSSR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (PIO_P_IOSSR) Register Mask  */

#define PIO_P_IOSSR_P_Pos                     _UINT32_(0)                                          /* (PIO_P_IOSSR Position) I/O Security Status */
#define PIO_P_IOSSR_P_Msk                     (_UINT32_(0xFFFFFFFF) << PIO_P_IOSSR_P_Pos)          /* (PIO_P_IOSSR Mask) P */
#define PIO_P_IOSSR_P(value)                  (PIO_P_IOSSR_P_Msk & (_UINT32_(value) << PIO_P_IOSSR_P_Pos)) 

/* -------- PIO_P_IOFR : (PIO Offset: 0x3C) ( /W 32) PIO Privilege I/O Freeze Configuration Register (p_iogroup = 0) -------- */
#define PIO_P_IOFR_FPHY_Pos                   _UINT32_(0)                                          /* (PIO_P_IOFR) Freeze Physical Configuration Position */
#define PIO_P_IOFR_FPHY_Msk                   (_UINT32_(0x1) << PIO_P_IOFR_FPHY_Pos)               /* (PIO_P_IOFR) Freeze Physical Configuration Mask */
#define PIO_P_IOFR_FPHY(value)                (PIO_P_IOFR_FPHY_Msk & (_UINT32_(value) << PIO_P_IOFR_FPHY_Pos)) /* Assigment of value for FPHY in the PIO_P_IOFR register */
#define PIO_P_IOFR_FINT_Pos                   _UINT32_(1)                                          /* (PIO_P_IOFR) Freeze Interrupt Configuration Position */
#define PIO_P_IOFR_FINT_Msk                   (_UINT32_(0x1) << PIO_P_IOFR_FINT_Pos)               /* (PIO_P_IOFR) Freeze Interrupt Configuration Mask */
#define PIO_P_IOFR_FINT(value)                (PIO_P_IOFR_FINT_Msk & (_UINT32_(value) << PIO_P_IOFR_FINT_Pos)) /* Assigment of value for FINT in the PIO_P_IOFR register */
#define PIO_P_IOFR_FRZKEY_Pos                 _UINT32_(8)                                          /* (PIO_P_IOFR) Freeze Key Position */
#define PIO_P_IOFR_FRZKEY_Msk                 (_UINT32_(0xFFFFFF) << PIO_P_IOFR_FRZKEY_Pos)        /* (PIO_P_IOFR) Freeze Key Mask */
#define PIO_P_IOFR_FRZKEY(value)              (PIO_P_IOFR_FRZKEY_Msk & (_UINT32_(value) << PIO_P_IOFR_FRZKEY_Pos)) /* Assigment of value for FRZKEY in the PIO_P_IOFR register */
#define   PIO_P_IOFR_FRZKEY_PASSWD_Val        _UINT32_(0x494F46)                                   /* (PIO_P_IOFR) Writing any other value in this field aborts the write operation of the WPEN bit.  */
#define PIO_P_IOFR_FRZKEY_PASSWD              (PIO_P_IOFR_FRZKEY_PASSWD_Val << PIO_P_IOFR_FRZKEY_Pos) /* (PIO_P_IOFR) Writing any other value in this field aborts the write operation of the WPEN bit. Position  */
#define PIO_P_IOFR_Msk                        _UINT32_(0xFFFFFF03)                                 /* (PIO_P_IOFR) Register Mask  */


