Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/pio.h
/* -------- PIO_WPMR : (PIO Offset: 0x5E0) (R/W 32) PIO Write Protection Mode Register -------- */
#define PIO_WPMR_WPEN_Pos                     _UINT32_(0)                                          /* (PIO_WPMR) Write Protection Enable Position */
#define PIO_WPMR_WPEN_Msk                     (_UINT32_(0x1) << PIO_WPMR_WPEN_Pos)                 /* (PIO_WPMR) Write Protection Enable Mask */
#define PIO_WPMR_WPEN(value)                  (PIO_WPMR_WPEN_Msk & (_UINT32_(value) << PIO_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the PIO_WPMR register */
#define PIO_WPMR_WPITEN_Pos                   _UINT32_(1)                                          /* (PIO_WPMR) Write Protection Interrupt Enable Position */
#define PIO_WPMR_WPITEN_Msk                   (_UINT32_(0x1) << PIO_WPMR_WPITEN_Pos)               /* (PIO_WPMR) Write Protection Interrupt Enable Mask */
#define PIO_WPMR_WPITEN(value)                (PIO_WPMR_WPITEN_Msk & (_UINT32_(value) << PIO_WPMR_WPITEN_Pos)) /* Assigment of value for WPITEN in the PIO_WPMR register */
#define PIO_WPMR_WPKEY_Pos                    _UINT32_(8)                                          /* (PIO_WPMR) Write Protection Key Position */
#define PIO_WPMR_WPKEY_Msk                    (_UINT32_(0xFFFFFF) << PIO_WPMR_WPKEY_Pos)           /* (PIO_WPMR) Write Protection Key Mask */
#define PIO_WPMR_WPKEY(value)                 (PIO_WPMR_WPKEY_Msk & (_UINT32_(value) << PIO_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the PIO_WPMR register */
#define   PIO_WPMR_WPKEY_PASSWD_Val           _UINT32_(0x50494F)                                   /* (PIO_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define PIO_WPMR_WPKEY_PASSWD                 (PIO_WPMR_WPKEY_PASSWD_Val << PIO_WPMR_WPKEY_Pos)    /* (PIO_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define PIO_WPMR_Msk                          _UINT32_(0xFFFFFF03)                                 /* (PIO_WPMR) Register Mask  */


/* -------- PIO_WPSR : (PIO Offset: 0x5E4) ( R/ 32) PIO Write Protection Status Register -------- */
#define PIO_WPSR_WPVS_Pos                     _UINT32_(0)                                          /* (PIO_WPSR) Write Protection Violation Status Position */
#define PIO_WPSR_WPVS_Msk                     (_UINT32_(0x1) << PIO_WPSR_WPVS_Pos)                 /* (PIO_WPSR) Write Protection Violation Status Mask */
#define PIO_WPSR_WPVS(value)                  (PIO_WPSR_WPVS_Msk & (_UINT32_(value) << PIO_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the PIO_WPSR register */
#define PIO_WPSR_WPVSRC_Pos                   _UINT32_(8)                                          /* (PIO_WPSR) Write Protection Violation Source Position */
#define PIO_WPSR_WPVSRC_Msk                   (_UINT32_(0xFFFF) << PIO_WPSR_WPVSRC_Pos)            /* (PIO_WPSR) Write Protection Violation Source Mask */
#define PIO_WPSR_WPVSRC(value)                (PIO_WPSR_WPVSRC_Msk & (_UINT32_(value) << PIO_WPSR_WPVSRC_Pos)) /* Assigment of value for WPVSRC in the PIO_WPSR register */
#define PIO_WPSR_Msk                          _UINT32_(0x00FFFF01)                                 /* (PIO_WPSR) Register Mask  */


/* -------- PIO_P_SCDR : (PIO Offset: 0x1500) (R/W 32) PIO Privilege Slow Clock Divider Debouncing Register -------- */
#define PIO_P_SCDR_DIV_Pos                    _UINT32_(0)                                          /* (PIO_P_SCDR) Slow Clock Divider Selection for Debouncing Position */
#define PIO_P_SCDR_DIV_Msk                    (_UINT32_(0x3FFF) << PIO_P_SCDR_DIV_Pos)             /* (PIO_P_SCDR) Slow Clock Divider Selection for Debouncing Mask */
#define PIO_P_SCDR_DIV(value)                 (PIO_P_SCDR_DIV_Msk & (_UINT32_(value) << PIO_P_SCDR_DIV_Pos)) /* Assigment of value for DIV in the PIO_P_SCDR register */
#define PIO_P_SCDR_Msk                        _UINT32_(0x00003FFF)                                 /* (PIO_P_SCDR) Register Mask  */


/* -------- PIO_P_WPMR : (PIO Offset: 0x15E0) (R/W 32) PIO Privilege Write Protection Mode Register -------- */
#define PIO_P_WPMR_WPEN_Pos                   _UINT32_(0)                                          /* (PIO_P_WPMR) Write Protection Enable Position */
#define PIO_P_WPMR_WPEN_Msk                   (_UINT32_(0x1) << PIO_P_WPMR_WPEN_Pos)               /* (PIO_P_WPMR) Write Protection Enable Mask */
#define PIO_P_WPMR_WPEN(value)                (PIO_P_WPMR_WPEN_Msk & (_UINT32_(value) << PIO_P_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the PIO_P_WPMR register */
#define PIO_P_WPMR_WPITEN_Pos                 _UINT32_(1)                                          /* (PIO_P_WPMR) Write Protection Interrupt Enable Position */
#define PIO_P_WPMR_WPITEN_Msk                 (_UINT32_(0x1) << PIO_P_WPMR_WPITEN_Pos)             /* (PIO_P_WPMR) Write Protection Interrupt Enable Mask */
#define PIO_P_WPMR_WPITEN(value)              (PIO_P_WPMR_WPITEN_Msk & (_UINT32_(value) << PIO_P_WPMR_WPITEN_Pos)) /* Assigment of value for WPITEN in the PIO_P_WPMR register */
#define PIO_P_WPMR_WPKEY_Pos                  _UINT32_(8)                                          /* (PIO_P_WPMR) Write Protection Key Position */
#define PIO_P_WPMR_WPKEY_Msk                  (_UINT32_(0xFFFFFF) << PIO_P_WPMR_WPKEY_Pos)         /* (PIO_P_WPMR) Write Protection Key Mask */
#define PIO_P_WPMR_WPKEY(value)               (PIO_P_WPMR_WPKEY_Msk & (_UINT32_(value) << PIO_P_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the PIO_P_WPMR register */
#define   PIO_P_WPMR_WPKEY_PASSWD_Val         _UINT32_(0x50494F)                                   /* (PIO_P_WPMR) Writing any other value in this field aborts the write operation of WPEN. Always reads as 0.  */
#define PIO_P_WPMR_WPKEY_PASSWD               (PIO_P_WPMR_WPKEY_PASSWD_Val << PIO_P_WPMR_WPKEY_Pos) /* (PIO_P_WPMR) Writing any other value in this field aborts the write operation of WPEN. Always reads as 0. Position  */
#define PIO_P_WPMR_Msk                        _UINT32_(0xFFFFFF03)                                 /* (PIO_P_WPMR) Register Mask  */


